# GetWorksharingDisplayMode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetWorksharingDisplayMode Method
View Class See Also
---
Gets the current worksharing display mode for this view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WorksharingDisplayMode GetWorksharingDisplayMode()
```

Visual Basic
---
```text
Public Function GetWorksharingDisplayMode As WorksharingDisplayMode
```

Visual C++
---
```text
public:
WorksharingDisplayMode GetWorksharingDisplayMode()
```

# ### Return Value
The active worksharing display mode in this view.
# Remarks
Returns "Off" if no worksharing display mode is currently enabled.
# See Also
View Class
Autodesk.Revit.DB Namespace